
public class TWCharacters {

	public int charIndex = -1;
	
    /**
     * キャラクタ名
     */
    public static final String[] _name = {
    	"ルシアン",
    	"ボリス",
    	"マキシミン",
    	"シベリン",
    	"ミラ",
    	"ティチエル",
    	"イスピン",
    	"ナヤトレイ",
    	"ジョシュア",
    	"クロエ",
    	"ランジエ",
    	"イサック",
    	"アナイス"
    };


    /**
     * 型名
     */
    public static final String[][] _styleName = {
    	/* ルシアン   */
    	{ "物理複合", "斬り", "突き" },
    	/* ボリス     */
    	{ "物理複合", "斬り", "魔剣士" },
    	/* マキシミン */
    	{ "物理複合", "斬り", "魔剣士" },
    	/* シベリン   */
    	{ "突き", "物理複合", "斬り" },
    	/* ミラ       */
    	{ "斬り", "物理複合", "突き" },
    	/* ティチエル */
    	{ "攻撃", "補助", "戦闘" },
    	/* イスピン   */
    	{ "突き", "物理複合", "斬り" },
    	/* ナヤトレイ */
    	{ "突き", "物理複合", "斬り" },
    	/* ジョシュア */
    	{ "強化", "変化", "放出" },
    	/* クロエ */
    	{ "炎術", "水術", "雷術" },
    	/* ランジエ */
    	{ "物理", "魔法", "補助" },
    	/* イサック */
    	{ "イⅠ型", "イⅡ型", "イⅢ型" },
    	/* アナイス */
    	{ "アⅠ型", "アⅡ型", "アⅢ型" }
    };

    /**
     * 型
     */
    private int[] _style = { 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

    /**
     * 初期ステータス
     */
    public static final int[][][] _defaultStatus = {
    	
        /* ルシアン   */
    	{    /* 物理複合 */ { 4, 3, 1, 2, 1, 2, 2, 220, 50, 1000, 1100 },
    	     /*    斬り  */ { 3, 4, 1, 3, 1, 2, 1, 240, 55,  900, 1150 },
    	     /*    突き  */ { 4, 3, 1, 1, 1, 2, 3, 200, 55, 1100, 1050 }
    	},
    	/* ボリス     */
    	{
    	    /* 物理複合 */ { 3, 4, 1, 3, 2, 1, 1, 200, 50, 950, 1100 },
    	    /*    斬り  */ { 2, 5, 1, 3, 2, 1, 1, 220, 55, 900, 1150 },
    	    /*   魔剣士 */ { 2, 4, 2, 2, 2, 2, 1, 185, 65, 850, 999 }
        },
    	/* マキシミン */
        {
            /* 物理複合 */ { 4, 4, 1, 2, 1, 2, 1, 190, 50, 950, 1050 },
            /*    斬り  */ { 3, 5, 1, 2, 1, 2, 1, 210, 55, 900, 1100 },
            /*   魔剣士 */ { 2, 4, 2, 2, 2, 2, 1, 175, 65, 850, 999 }
        },
    	/* シベリン   */
        {
            /*    突き  */ { 5, 2, 1, 3, 1, 2, 1, 220, 45, 1300, 1150 },
            /* 物理複合 */ { 4, 4, 1, 3, 1, 1, 1, 240, 40, 1200, 1200 },
            /*    斬り  */ { 2, 5, 1, 4, 1, 1, 1, 260, 40, 1100, 1250 }
        },
    	/* ミラ       */
        {
            /*    斬り  */ { 2, 4, 1, 1, 2, 3, 2, 210, 35, 1000,  950 },
            /* 物理複合 */ { 4, 4, 1, 1, 1, 2, 2, 190, 40, 1100,  900 },
            /*    突き  */ { 4, 2, 1, 1, 2, 3, 2, 170, 35, 1200,  850 }
        },
    	/* ティチエル */
        {
            /* 　攻撃　 */ { 1, 2, 4, 1, 3, 2, 2, 160, 80, 800, 750 },
            /*   補助   */ { 1, 2, 2, 2, 3, 2, 3, 170, 90, 900, 800 },
            /*   戦闘   */ { 1, 3, 1, 3, 2, 2, 3, 185, 70, 1100, 850 }
        },
    	/* イスピン   */
        {
            /*    突き  */ { 4, 2, 1, 2, 1, 3, 2, 190, 45, 1200,  900 },
            /* 物理複合 */ { 4, 3, 1, 2, 1, 2, 2, 210, 50, 1100,  950 },
            /*    斬り  */ { 2, 4, 1, 2, 1, 3, 2, 200, 55, 1000, 1000 }
        },
    	/* ナヤトレイ */
        {
            /*    突き  */ { 4, 2, 1, 1, 1, 3, 3, 185, 40, 1400,  850 },
            /* 物理複合 */ { 4, 3, 1, 1, 1, 3, 2, 205, 45, 1300,  900 },
            /*    斬り  */ { 2, 4, 1, 1, 1, 4, 2, 225, 50, 1200,  950 }
        },
        /* ジョシュア */
        {
            /* 強化 */ { 4, 2, 3, 1, 3, 1, 1, 220, 60, 930, 1075 },
            /* 変化 */ { 3, 1, 3, 2, 3, 2, 1, 220, 70, 920, 1050 },
            /* 放出 */ { 3, 1, 4, 1, 3, 2, 1, 220, 75, 910, 1050 }
        },
        /* クロエ */
        {
            /* 炎術 */ { 1, 2, 4, 1, 3, 2, 2, 180, 80, 800, 750 },
            /* 水術 */ { 1, 2, 3, 2, 4, 2, 2, 170, 90, 900, 800 },
            /* 雷術 */ { 1, 2, 3, 1, 3, 3, 2, 180, 70,1000, 850 }
        },
        /* ランジエ */
        {
            /* 物理 */ { 4, 2, 2, 1, 3, 2, 1, 220, 60, 930, 1125 },
            /* 魔法 */ { 2, 1, 4, 2, 3, 2, 1, 210, 70, 920, 1100 },
            /* 補助 */ { 3, 1, 3, 1, 3, 2, 2, 200, 80, 910, 1115 }
        },
        /* イサック */
        {
            /* イⅠ型 */ { 4, 2, 3, 1, 3, 1, 1, 220, 60, 930, 1075 },
            /* イⅡ型 */ { 3, 1, 3, 2, 3, 2, 1, 220, 70, 920, 1050 },
            /* イⅢ型 */ { 3, 1, 4, 1, 3, 2, 1, 220, 75, 910, 1050 }
        },
        /* アナイス */
        {
            /* アⅠ型 */ { 4, 2, 3, 1, 3, 1, 1, 220, 60, 930, 1075 },
            /* アⅡ型 */ { 3, 1, 3, 2, 3, 2, 1, 220, 70, 920, 1050 },
            /* アⅢ型 */ { 3, 1, 4, 1, 3, 2, 1, 220, 75, 910, 1050 }
        },
    };
    
    /**
     * 初期必要ポイント
     */
    public static final int [][][] _defaultNeedPoints = {

    	/* ルシアン   */
    	{   /* 物理複合 */ { 1, 1, 3, 2, 3, 2, 2 },
    	    /*    斬り  */ { 2, 1, 3, 1, 3, 2, 2 },
    	    /*    突き  */ { 1, 2, 3, 2, 3, 2, 1 }
    	},
    	/* ボリス     */
    	{
    	    /* 物理複合 */ { 2, 1, 3, 1, 3, 2, 2 },
    	    /*    斬り  */ { 3, 1, 3, 1, 2, 2, 2 },
    	    /*   魔剣士 */ { 3, 1, 2, 2, 3, 1, 2 }
    	},
    	/* マキシミン */
    	{
    	    /* 物理複合 */ { 1, 1, 3, 2, 3, 2, 2 },
    	    /*    斬り  */ { 2, 1, 3, 2, 3, 1, 2 },
    	    /*   魔剣士 */ { 3, 1, 2, 3, 2, 1, 2 }
    	},
    	/* シベリン   */
    	{
    	    /*    突き  */ { 1, 2, 3, 1, 3, 2, 2 },
    	    /* 物理複合 */ { 1, 1, 3, 2, 3, 2, 2 },
    	    /*    斬り  */ { 2, 1, 3, 1, 3, 2, 2 }
    	},
    	/* ミラ       */
    	{
    	    /*    斬り  */ { 2, 1, 3, 2, 3, 1, 2 },
    	    /* 物理複合 */ { 1, 1, 3, 2, 3, 2, 2 },
    	    /*    突き  */ { 1, 2, 3, 2, 3, 1, 2 }
    	},
    	/* ティチエル */
    	{
    	    /* 　攻撃　 */ { 3, 2, 2, 3, 1, 1, 2 },
    	    /*   補助   */ { 3, 3, 2, 2, 1, 2, 1 },
    	    /*   戦闘   */ { 2, 1, 3, 3, 2, 2, 1 }
    	},
    	/* イスピン   */
    	{
    	    /*    突き  */ { 1, 2, 3, 2, 3, 1, 2 },
    	    /* 物理複合 */ { 1, 1, 3, 2, 3, 2, 2 },
    	    /*    斬り  */ { 2, 1, 3, 2, 3, 1, 2 },
    	},
    	/* ナヤトレイ */
    	{
    	    /*    突き  */ { 1, 2, 3, 2, 3, 2, 1 },
    	    /* 物理複合 */ { 1, 1, 3, 2, 3, 2, 2 },
    	    /*    斬り  */ { 2, 1, 3, 2, 3, 1, 2 }
    	},
    	/* ジョシュア */
    	{
    	    /* 強化 */ { 1, 2, 3, 1, 3, 2, 2 },
    	    /* 変化 */ { 2, 3, 2, 2, 1, 2, 2 },
    	    /* 放出 */ { 2, 3, 2, 3, 1, 1, 2 }
    	},
    	/* クロエ */
    	{
    	    /* 炎術 */ { 3, 2, 2, 3, 1, 1, 2 },
    	    /* 水術 */ { 3, 2, 2, 3, 1, 1, 2 },
    	    /* 雷術 */ { 3, 2, 2, 3, 1, 1, 2 }
    	},
    	/* ランジエ */
    	{
    	    /* 物理 */ { 1, 2, 3, 1, 3, 2, 2 },
    	    /* 魔法 */ { 2, 3, 2, 2, 1, 2, 2 },
    	    /* 補助 */ { 2, 3, 2, 3, 1, 1, 2 }
    	},
    	/* イサック */
    	{
    	    /* イⅠ型 */ { 1, 2, 3, 1, 3, 2, 2 },
    	    /* イⅡ型 */ { 2, 3, 2, 2, 1, 2, 2 },
    	    /* イⅢ型 */ { 2, 3, 2, 3, 1, 1, 2 }
    	},
    	/* アナイス */
    	{
    	    /* アⅠ型 */ { 1, 2, 3, 1, 3, 2, 2 },
    	    /* アⅡ型 */ { 2, 3, 2, 2, 1, 2, 2 },
    	    /* アⅢ型 */ { 2, 3, 2, 3, 1, 1, 2 }
    	}
    };

    /**
     * 初期Xien
     */
    public static final int [][][] _defaultXien = {

        /* ルシアン   */
    	{    /* 物理複合 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
             /*    斬り  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
             /*    突き  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* ボリス     */
    	{
    	    /* 物理複合 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*    斬り  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*   魔剣士 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* マキシミン */
    	{
    	    /* 物理複合 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*    斬り  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*   魔剣士 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* シベリン   */
    	{
    	    /*    突き  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 物理複合 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*    斬り  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* ミラ       */
    	{
    	    /*    斬り  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 物理複合 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*    突き  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* ティチエル */
    	{
    	    /* 　攻撃　 */ { 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*   補助   */ { 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*   戦闘   */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* イスピン   */
    	{
    	    /*    突き  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 物理複合 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*    斬り  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* ナヤトレイ */
    	{
    	    /*    突き  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 物理複合 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /*    斬り  */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* ジョシュア */
    	{
    	    /* 強化 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 変化 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 放出 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* クロエ */
    	{
    	    /* 炎術 */ { 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 水術 */ { 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 雷術 */ { 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* ランジエ */
    	{
    	    /* 物理 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 魔法 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0 },
    	    /* 補助 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0 }
    	},
    	/* イサック */
    	{
    	    /* イⅠ型 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0 },
    	    /* イⅡ型 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0 },
    	    /* イⅢ型 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0 }
    	},
    	/* アナイス */
    	{
    	    /* アⅠ型 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0 },
    	    /* アⅡ型 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0 },
    	    /* アⅢ型 */ { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0 }
    	},
    };
    
    public static int [][][] _maxXien = new int[13][29][255];
    
    /**
     * キャラクタ名を取得
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getName()
     */
    public String getName() {
        return _name[charIndex];
    }

    /**
     * 型名を取得
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getStyleName()
     */
    public String getStyleName() {
        return _styleName[charIndex][_style[charIndex]];
    }

    /**
     * 全型名を取得
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getStyleInfo()
     */
    public String[] getStyleInfo() {
        return _styleName[charIndex];
    }

    /**
     * 選択可能全Xienを取得
     * 
     * @return 選択可能全Xien
     */
    public String[] getXienInfo () {

    	int[] maxXienPoints = getMaxXienPoints(Status.MAX_LEVEL);
        

		String[] tmpXienInfo = new String[maxXienPoints.length];
        int xienLength = 0;
        
        for(int i = 0; i < maxXienPoints.length; i++) {
            if(maxXienPoints[i] > 0) {
                tmpXienInfo[xienLength] = Status.XIEN_NAME[i];
                xienLength++;
            }
        }

        String[] xienInfo = new String[xienLength];
        for(int i = 0; i < xienLength; i++) {
            xienInfo[i] = tmpXienInfo[i];
        }
        
        return xienInfo;
    }

    /**
     * 初期ステータスを取得 
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getDefaultStatus()
     */
    public int[] getDefaultStatus() {
        return _defaultStatus[charIndex][_style[charIndex]];
    }

    /**
     * 初期必要ポイントを取得
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getDefaultNeedPoints()
     */
    public int[] getDefaultNeedPoints() {
        return _defaultNeedPoints[charIndex][_style[charIndex]];
    }

    /**
     * 初期Xienを取得
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getDefaultXien()
     */
    public int[] getDefaultXien() {
        return _defaultXien[charIndex][_style[charIndex]];
    }

    /**
     * 初期Xienを取得
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getDefaultXienIndex()
     */
    public int getDefaultXienIndex(int styleIndex) {

    	int xienIndex = 0;
    	for (int i = 0; i < _defaultXien[charIndex][styleIndex].length; i ++ ) {
    		if(_defaultXien[charIndex][styleIndex][xienIndex] <= _defaultXien[charIndex][styleIndex][i]) {
    			xienIndex = i;
    		}
    	}
        return xienIndex;
    }

    /**
     * 型設定
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#setStyleIndex(int)
     */
    public void setStyleIndex(int style) {
        _style[charIndex] = style;
    }

    /**
     * 型取得
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getStyleIndex()
     */
    public int getStyleIndex() {
        return _style[charIndex];
    }

    /**
     * 最大配分可能Xien数を取得
     * 
     * @see jp.ore.tool.stm.character.TWCharacter#getMaxXienPoints(int)
     */
    public int[] getMaxXienPoints(int level) {
        
        
        int[] tmpLevel = {
                level, level, level, level, level,
                level, level, level, level, level,
                level, level, level, level, level, level, level, level, level, level,
                level, level, level,
                level, level, level,
                level, level, level
                };
        
    	for (int i = 0; i < tmpLevel.length; i++) {
            if ( _maxXien[charIndex][i].length < tmpLevel[i]) {
                tmpLevel[i] = _maxXien[charIndex][i].length;
            }
        }
        
        int[] xien = {
                _maxXien[charIndex][0][tmpLevel[0] - 1],
                _maxXien[charIndex][1][tmpLevel[1] - 1],
                _maxXien[charIndex][2][tmpLevel[2] - 1],
                _maxXien[charIndex][3][tmpLevel[3] - 1],
                _maxXien[charIndex][4][tmpLevel[4] - 1],
                _maxXien[charIndex][5][tmpLevel[5] - 1],
                _maxXien[charIndex][6][tmpLevel[6] - 1],
                _maxXien[charIndex][7][tmpLevel[7] - 1],
                _maxXien[charIndex][8][tmpLevel[8] - 1],
                _maxXien[charIndex][9][tmpLevel[9] - 1],
                _maxXien[charIndex][10][tmpLevel[10] - 1],
                _maxXien[charIndex][11][tmpLevel[11] - 1],
                _maxXien[charIndex][12][tmpLevel[12] - 1],
                _maxXien[charIndex][13][tmpLevel[13] - 1],
                _maxXien[charIndex][14][tmpLevel[14] - 1],
                _maxXien[charIndex][15][tmpLevel[15] - 1],
                _maxXien[charIndex][16][tmpLevel[16] - 1],
                _maxXien[charIndex][17][tmpLevel[17] - 1],
                _maxXien[charIndex][18][tmpLevel[18] - 1],
                _maxXien[charIndex][19][tmpLevel[19] - 1],
                _maxXien[charIndex][20][tmpLevel[20] - 1],
                _maxXien[charIndex][21][tmpLevel[21] - 1],
                _maxXien[charIndex][22][tmpLevel[22] - 1],
                _maxXien[charIndex][23][tmpLevel[23] - 1],
                _maxXien[charIndex][24][tmpLevel[24] - 1],
                _maxXien[charIndex][25][tmpLevel[25] - 1],
                _maxXien[charIndex][26][tmpLevel[26] - 1],
                _maxXien[charIndex][27][tmpLevel[27] - 1],
                _maxXien[charIndex][28][tmpLevel[28] - 1]
        };
        
        return xien;
    }

    /**
     * 初期化
     */
    public void init() {
       _style[charIndex] = 0;
    }

}
